#Setup
tap "homebrew/cask"
tap "argoproj/tap"
tap "wallix/awless"
tap "drone/drone"

#Browsers
cask "firefox"
cask "google-chrome"


#Cloud Utils
brew "awscli"
brew "kubectx"

#Editors
brew "bat"
cask "visual-studio-code"
mas "xcode", id: 497799835

#Development Tools
cask "docker"
brew "golang"
brew "node"
brew "kubernetes-cli"
brew "git-lfs"


#Security Tools
cask "viscosity"

#Communication
cask "spotify"


#Computer Utils
brew "ffmpeg"
brew "figlet"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
cask "vlc"

cask "alfred"
cask "karabiner-elements"
mas "amphetamine", id: 937984704

#yaakov's
mas "new-terminal-here", id: 1067646949
mas "daisydisk", id: 411643860
mas "keka", id: 470158793
mas "the-unarchiver", id: 425424353
mas "textual-7", id: 1262957439
mas "pastebot", id: 1179623856
mas "table-tool", id: 1122008420
mas "base-sqlite-editor", id: 402383384
mas "kaleidoscope", id: 587512244
mas "tweetbot-2-for-twitter", id: 557168941
mas "prepo", id: 476533227
mas "deliveries", id: 924726344
mas "bitpay", id: 1440200291
mas "telegram", id: 747648890

brew "python"
brew "rbenv"
brew "mutt"
brew "newsboat"
brew "socat"
brew "mosh"
brew "fish"
brew "mitmproxy"
brew "imagemagick"
brew "tmate"
brew "youtube-dl"
brew "jq"
brew "swiftlint"
brew "irssi"
brew "stern"
brew "neovim"

cask "webtorrent"
cask "postman"
cask "spectacle"
cask "qutebrowser"
